Revit 2026 API

# WireSizeAmpacity Property

---

Get ampacity which be used for specifying size, the unit is ampere.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public long Ampacity { get; }
```
```vb
Public ReadOnly Property Ampacity As Long
	Get
```
```cpp
public:
property long long Ampacity {
	long long get ();
}
```
```fsharp
member Ampacity : int64 with get
```

#### Property Value

Int64

#### Reference

WireSize Class

Autodesk.Revit.DB.Electrical Namespace